In [1]:
#Create employees dataframe
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:
#Create department dataframe
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [7]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [9]:
#merge dataframes to get department 40 in employees and department 30 in departments
pd.merge(employees,departments, on="DeptID") #Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [11]:
pd.merge(employees,departments, on="DeptID", how="left") #left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [13]:
pd.merge(employees,departments, on="DeptID", how="right") #Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [15]:
pd.merge(employees,departments, on="DeptID", how="outer") #outer Join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [17]:
#Concatenate DFs
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [19]:
df1

    Name
0  Alice
1    Bob

In [21]:
df2

      Name
0  Charlie
1    David

In [23]:
pd.concat([df1,df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [25]:
pd.concat([df1,df2], axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [27]:
df3 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score": [91,92]})
df4 = pd.DataFrame({"Name": ["Charlie", "David"], "Age": [25,29]})

In [29]:
df3

    Name  Score
0  Alice     91
1    Bob     92

In [31]:
df4

      Name  Age
0  Charlie   25
1    David   29

In [33]:
pd.concat([df3,df4], axis=1)

    Name  Score     Name  Age
0  Alice     91  Charlie   25
1    Bob     92    David   29